{
  "architectures": [
    "DeepseekV32ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "aux_loss_alpha": 0.001,
  "beta_fast": 32,
  "beta_slow": 1,
  "bos_token_id": 0,
  "dim": 7168,
  "dtype": "bfloat16",
  "eos_token_id": 1,
  "ep_size": 1,
  "first_k_dense_replace": 3,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 7168,
  "index_head_dim": 128,
  "index_n_heads": 64,
  "index_top_k": 2048,
  "index_topk": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 18432,
  "kv_lora_rank": 512,
  "max_batch_size": 8,
  "max_position_embeddings": 163840,
  "max_seq_len": 16384,
  "mlp_bias": false,
  "model_type": "deepseek_v32",
  "moe_intermediate_size": 2048,
  "moe_layer_freq": 1,
  "mscale": 1.0,
  "n_group": 8,
  "n_routed_experts": 256,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 128,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 61,
  "num_key_value_heads": 128,
  "num_nextn_predict_layers": 1,
  "original_seq_len": 4096,
  "q_lora_rank": 1536,
  "qk_head_dim": 192,
  "qk_nope_head_dim": 128,
  "qk_rope_head_dim": 64,
  "quantization_config": {
    "autoround_version": "0.9.5",
    "backend": "gptq",
    "checkpoint_format": "gptq_v1",
    "bits": 4,
    "data_type": "int",
    "extra_config": {
      "model.layers.0.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.0.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.1.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.1.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.10.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.10.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.11.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.11.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.12.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.12.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.13.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.13.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.14.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.14.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.15.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.15.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.16.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.16.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.17.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.17.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.18.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.18.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.19.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.19.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.2.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.2.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.20.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.20.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.21.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.21.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.22.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.22.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.23.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.23.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.24.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.24.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.25.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.25.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.26.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.26.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.27.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.27.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.28.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.28.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.29.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.29.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.3.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.3.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.30.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.30.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.31.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.31.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.32.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.32.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.33.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.33.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.34.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.34.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.35.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.35.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.36.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.36.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.37.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.37.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.38.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.38.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.39.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.39.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.4.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.4.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.40.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.40.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.41.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.41.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.42.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.42.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.43.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.43.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.44.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.44.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.45.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.45.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.46.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.46.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.47.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.47.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.48.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.48.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.49.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.49.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.5.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.5.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.50.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.50.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.51.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.51.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.52.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.52.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.53.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.53.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.54.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.54.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.55.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.55.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.56.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.56.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.57.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.57.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.58.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.58.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.59.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.59.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.6.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.6.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.60.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.60.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.7.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.7.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.8.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.8.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.9.self_attn.indexer.wk": {
        "bits": 16,
        "data_type": "float"
      },
      "model.layers.9.self_attn.indexer.wq_b": {
        "bits": 16,
        "data_type": "float"
      }
    },
    "group_size": 128,
    "iters": 0,
    "low_gpu_mem_usage": true,
    "packing_format": "auto_round:auto_gptq",
    "quant_method": "auto-round",
    "sym": true
  },
  "rms_norm_eps": 1e-06,
  "rope_factor": 40,
  "rope_interleave": true,
  "rope_scaling": {
    "beta_fast": 32,
    "beta_slow": 1,
    "factor": 40,
    "mscale": 1.0,
    "mscale_all_dim": 1.0,
    "original_max_position_embeddings": 4096,
    "rope_type": "yarn",
    "type": "yarn"
  },
  "rope_theta": 10000.0,
  "routed_scaling_factor": 2.5,
  "scale_fmt": null,
  "scoring_func": "sigmoid",
  "seq_aux": true,
  "tie_word_embeddings": false,
  "topk_group": 4,
  "topk_method": "noaux_tc",
  "transformers_version": "4.57.3",
  "use_cache": true,
  "v_head_dim": 128,
  "vocab_size": 129280
}
